---
kind: method
id: M:Autodesk.Revit.Exceptions.CentralFileCommunicationException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
source: html/5fff5dec-6039-0dcf-f653-f8f440702623.htm
---
# Autodesk.Revit.Exceptions.CentralFileCommunicationException.GetObjectData Method

Retrieves data needed to serialize the target object.

## Syntax (C#)
```csharp
public override void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
```

## Parameters
- **info** (`System.Runtime.Serialization.SerializationInfo`) - Data needed to serialize or deserialize the object.
- **context** (`System.Runtime.Serialization.StreamingContext`) - The destination of the serialized stream.